## 讀取591 房屋數據

In [1]:
import pandas as pd
link = 'https://raw.githubusercontent.com/ywchiu/cathaylifepy/master/data/rent591.xlsx' 
df = pd.read_excel(link, index_col=0)
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,"43,800",2180,2019/06/05
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,"120,000",1722,2019/06/05
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"130,000",3272,2016/12/14
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,"36,000",4890,2019/02/26
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,"30,000",4900,2019/06/04

In [4]:
(df['area'] / 0.3025).head()

0     92.561983
1    228.099174
2    235.702479
3     36.363636
4     52.892562
Name: area, dtype: float64

In [6]:
import numpy as np
np.sqrt(df['area']).head()

0    5.291503
1    8.306624
2    8.443933
3    3.316625
4    4.000000
Name: area, dtype: float64

In [10]:
(df['address'] + '-' +df['price'] ).head()

0     復興南路160巷精華地段雙..-43,800
1    臥龍街前眺101後擁山景,..-120,000
2     光復南路高樓層大巨蛋正對..-130,000
3      信義路三段台北大安森林公..-36,000
4         和平東路一段和平大..-30,000
dtype: object

In [11]:
df['square_feet'] = df['area'] / 0.3025

In [12]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,"43,800",2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,"120,000",1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"130,000",3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,"36,000",4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,"30,000",4900,2019/06/04,52.892562

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 772 entries, 0 to 21
Data columns (total 9 columns):
address          772 non-null object
floor            772 non-null int64
allfloor         772 non-null int64
layout           772 non-null object
area             772 non-null float64
price            772 non-null object
browsenum_all    772 non-null int64
created_date     767 non-null object
square_feet      772 non-null float64
dtypes: float64(2), int64(3), object(4)
memory usage: 60.3+ KB

In [15]:
df['price'].dtypes

dtype('O')

In [18]:
s = '43,800'
int(s.replace(',',''))

43800

In [19]:
def normalizePrice(ele):
    res = int(ele.replace(',', ''))
    return res

normalizePrice(s)

43800

In [21]:
df['price'].map(normalizePrice).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [22]:
def normalizePrice(ele):
    res = int(ele.replace(',', ''))
    return res

normalizePrice2 = lambda ele: int(ele.replace(',', ''))

In [23]:
df['price'].map(normalizePrice2).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [24]:
df['price'].map(lambda ele: int(ele.replace(',', ''))).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [36]:
df['price'] = df['price'].map(lambda ele: int(ele.replace(',', '')))

In [37]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,130000,3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019/06/04,52.892562

In [34]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [38]:
df2 = pd.DataFrame(\
 [\
    [60,70,50],\
    [80,79,68],\
    [63,66,82]], \
columns = ['First', 'Second', 'Third'])
df2

   First  Second  Third
0     60      70     50
1     80      79     68
2     63      66     82

In [39]:
df2.apply(lambda e: e.max() - e.min(), axis = 0)

First     20
Second    13
Third     32
dtype: int64

In [40]:
df2.apply(lambda e: e.max() - e.min(), axis = 1)

0    20
1    12
2    19
dtype: int64

In [42]:
df2.applymap(lambda e: '$'+str(e))

  First Second Third
0   $60    $70   $50
1   $80    $79   $68
2   $63    $66   $82

## 時間格式資料
- https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [43]:
a = '2019-07-09'
b = '2019-01-01'
a - b

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [47]:
from datetime import datetime
current_time = datetime.now()

In [48]:
current_time.strftime('%Y-%m-%d')

'2019-07-09'

In [51]:
boy = datetime.strptime('2019-01-01','%Y-%m-%d')
boy

datetime.datetime(2019, 1, 1, 0, 0)

In [52]:
current_time - boy

datetime.timedelta(189, 36034, 918176)

In [54]:
(current_time - boy).days

189

In [55]:
from datetime import timedelta
current_time - timedelta(days = 1)

datetime.datetime(2019, 7, 8, 10, 0, 34, 918176)

In [56]:
current_time - timedelta(days = 10)

datetime.datetime(2019, 6, 29, 10, 0, 34, 918176)

In [57]:
current_time + timedelta(days = 10)

datetime.datetime(2019, 7, 19, 10, 0, 34, 918176)

In [58]:
for i in range(10):
    dt = current_time - timedelta(days = i)
    print(dt.strftime('%Y/%m/%d'))

2019/07/09
2019/07/08
2019/07/07
2019/07/06
2019/07/05
2019/07/04
2019/07/03
2019/07/02
2019/07/01
2019/06/30

In [59]:
from time import mktime 
mktime(current_time.timetuple())

1562637634.0

In [60]:
datetime.fromtimestamp(1555860118)

datetime.datetime(2019, 4, 21, 23, 21, 58)

In [62]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,130000,3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019/06/04,52.892562

In [64]:
df['created_date'] = pd.to_datetime(df['created_date'], format = '%Y/%m/%d')

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 772 entries, 0 to 21
Data columns (total 9 columns):
address          772 non-null object
floor            772 non-null int64
allfloor         772 non-null int64
layout           772 non-null object
area             772 non-null float64
price            772 non-null int64
browsenum_all    772 non-null int64
created_date     767 non-null datetime64[ns]
square_feet      772 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 60.3+ KB

In [69]:
df[df['created_date'] > '2019-01-01'].head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019-06-05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019-06-05,228.099174
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019-02-26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019-06-04,52.892562
5,和平東路二段師大商..,2,4,2房1廳1衛,23.0,23009,9627,2019-06-13,76.033058

In [70]:
b = '2019-12-31'
a = '2019-01-01'

db = datetime.strptime(b,'%Y-%m-%d')
da = datetime.strptime(a,'%Y-%m-%d')

In [72]:
ary = []
for i in range(365):
    dt = da + timedelta(i)
    ary.append(dt)
s = pd.Series(ary)

In [82]:
#s.dt.month
#s.dt.week
df3 = pd.concat([s, s.dt.weekday, s.dt.week, s.dt.month], axis = 1)

In [84]:
df3.columns = ['date', 'weekday', 'week', 'month']

In [96]:
# 挑出星期五
df3  = df3[df3['weekday'] == 4]

#把每個月的最後一週列出來
c = df3.groupby('month')['week'].transform(max)
c.head()

3     4
10    4
17    4
24    4
31    8
Name: week, dtype: int64

In [98]:
#把每個月的最後一週星期五列出來
df3[df3['week'] == c].head()

          date  weekday  week  month
24  2019-01-25        4     4      1
52  2019-02-22        4     8      2
87  2019-03-29        4    13      3
115 2019-04-26        4    17      4
150 2019-05-31        4    22      5